Revit 2024 API
ComboBox.DropDownOpened Event
Subscribe to this event to be notified when the drop-down of the ComboBox is opened.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public event EventHandler<ComboBoxDropDownOpenedEventArgs> DropDownOpened
Visual Basic
Public Event DropDownOpened As EventHandler(Of ComboBoxDropDownOpenedEventArgs)
Visual C++
public:
 event EventHandler<ComboBoxDropDownOpenedEventArgs^>^ DropDownOpened {
	void add (EventHandler<ComboBoxDropDownOpenedEventArgs^>^ value);
	void remove (EventHandler<ComboBoxDropDownOpenedEventArgs^>^ value);
}
See Also
ComboBox Class
Autodesk.Revit.UI Namespace